bases/WIM_FIn/projects/IMDEV-7330 Оптимизация 1С ФИН_Расчет НДФЛ/Расширения/NDFL_RDU/DataProcessors/ФормированиеНачисленийНДФЛ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ФормированиеНачисленийНДФЛ</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Период</Name>
					<Type>
						<v8:Type>v8:StandardPeriod</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НалоговыйПериод</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Периоды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НеСоздаватьДокументыПоКлиентамБезЦБ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НомерСтрокиПо</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НомерСтрокиС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВариантЗаполнения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НеСоздаватьДокументыБезУдержаний</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СоздаватьОплатуНДФЛ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СхемаВыплаты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СчетДляОплатыНалогов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>УправляющаяКомпания</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ФормироватьНачисленияПоЗакрытымПортфелям</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ФормироватьНачисленияТолькоПоПортфелямСДвижениямиПоНДФЛ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ФормироватьПоЗакрытымПортфелямСПоступлениемНКД</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатыДокументов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>УправляющаяКомпания</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Клиент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>СхемаРеинвестирования</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

bases/WIM_FIn/projects/IMDEV-7330 Оптимизация 1С ФИН_Расчет НДФЛ/Расширения/NDFL_RDU/DataProcessors/ФормированиеНачисленийНДФЛ/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

// IMDEV-7330 Модуль менеджера обработки «ФормированиеНачисленийНДФЛ» (расширение NDFL_RDU):
// ДО оркестратор — ДлительныеОперации.ВыполнитьВФоне; дочерние пачки — ДлительныеОперации.ВыполнитьПроцедуруМодуляОбъектаОбработки
// (экспорт NDFL_RDU_ВыполнитьПачкуФормированияНДФЛ в модуле объекта обработки).
// Перехваты и кэш по пачкам — в модуле объекта той же обработки (Ext/ObjectModule.bsl).

#Область IMDEV7330_ПараллельноеФормированиеНДФЛ

#Область СлужебныеПроцедурыИФункцииСнимка

// Описание: Формирует сериализуемую структуру снимка шапки и ТЧ «ДатыДокументов» для передачи в ДО/воркеры.
//
// Параметры:
// ОбъектОбработки - ОбработкаОбъект.ФормированиеНачисленийНДФЛ - источник данных.
//
// Возвращаемое значение:
// Структура - поля шапки и таблица ДатыДокументов (копия выгрузки ТЧ).
//
Функция NDFL_RDU_СнимокОбъектаОбработки(ОбъектОбработки) Экспорт
	
	Снимок = Новый Структура;
	Снимок.Вставить("ПериодДатаНачала", ОбъектОбработки.Период.ДатаНачала);
	Снимок.Вставить("ПериодДатаОкончания", ОбъектОбработки.Период.ДатаОкончания);
	Снимок.Вставить("НалоговыйПериод", ОбъектОбработки.НалоговыйПериод);
	Снимок.Вставить("НеСоздаватьДокументыПоКлиентамБезЦБ", ОбъектОбработки.НеСоздаватьДокументыПоКлиентамБезЦБ);
	Снимок.Вставить("НомерСтрокиПо", ОбъектОбработки.НомерСтрокиПо);
	Снимок.Вставить("НомерСтрокиС", ОбъектОбработки.НомерСтрокиС);
	Снимок.Вставить("ВариантЗаполнения", ОбъектОбработки.ВариантЗаполнения);
	Снимок.Вставить("Клиент", ОбъектОбработки.Клиент);
	Снимок.Вставить("НеСоздаватьДокументыБезУдержаний", ОбъектОбработки.НеСоздаватьДокументыБезУдержаний);
	Снимок.Вставить("СоздаватьОплатуНДФЛ", ОбъектОбработки.СоздаватьОплатуНДФЛ);
	Снимок.Вставить("СхемаВыплаты", ОбъектОбработки.СхемаВыплаты);
	Снимок.Вставить("СчетДляОплатыНалогов", ОбъектОбработки.СчетДляОплатыНалогов);
	Снимок.Вставить("УправляющаяКомпания", ОбъектОбработки.УправляющаяКомпания);
	Снимок.Вставить("ФормироватьНачисленияПоЗакрытымПортфелям", ОбъектОбработки.ФормироватьНачисленияПоЗакрытымПортфелям);
	Снимок.Вставить("ФормироватьНачисленияТолькоПоПортфелямСДвижениямиПоНДФЛ",
		ОбъектОбработки.ФормироватьНачисленияТолькоПоПортфелямСДвижениямиПоНДФЛ);
	Снимок.Вставить("ФормироватьПоЗакрытымПортфелямСПоступлениемНКД", ОбъектОбработки.ФормироватьПоЗакрытымПортфелямСПоступлениемНКД);
	Снимок.Вставить("ДатыДокументов", ОбъектОбработки.ДатыДокументов.Выгрузить());
	
	Возврат Снимок;
	
КонецФункции

// Описание: Заполняет объект обработки из снимка (зеркально NDFL_RDU_СнимокОбъектаОбработки).
//
// Параметры:
// ОбъектОбработки - ОбработкаОбъект.ФормированиеНачисленийНДФЛ - целевой объект.
// Снимок - Структура - данные снимка.
//
Процедура NDFL_RDU_ЗаполнитьОбъектОбработкиИзСнимка(ОбъектОбработки, Снимок) Экспорт
	
	ОбъектОбработки.Период.ДатаНачала = Снимок.ПериодДатаНачала;
	ОбъектОбработки.Период.ДатаОкончания = Снимок.ПериодДатаОкончания;
	ОбъектОбработки.НалоговыйПериод = Снимок.НалоговыйПериод;
	ОбъектОбработки.НеСоздаватьДокументыПоКлиентамБезЦБ = Снимок.НеСоздаватьДокументыПоКлиентамБезЦБ;
	ОбъектОбработки.НомерСтрокиПо = Снимок.НомерСтрокиПо;
	ОбъектОбработки.НомерСтрокиС = Снимок.НомерСтрокиС;
	ОбъектОбработки.ВариантЗаполнения = Снимок.ВариантЗаполнения;
	ОбъектОбработки.Клиент = Снимок.Клиент;
	ОбъектОбработки.НеСоздаватьДокументыБезУдержаний = Снимок.НеСоздаватьДокументыБезУдержаний;
	ОбъектОбработки.СоздаватьОплатуНДФЛ = Снимок.СоздаватьОплатуНДФЛ;
	ОбъектОбработки.СхемаВыплаты = Снимок.СхемаВыплаты;
	ОбъектОбработки.СчетДляОплатыНалогов = Снимок.СчетДляОплатыНалогов;
	ОбъектОбработки.УправляющаяКомпания = Снимок.УправляющаяКомпания;
	ОбъектОбработки.ФормироватьНачисленияПоЗакрытымПортфелям = Снимок.ФормироватьНачисленияПоЗакрытымПортфелям;
	ОбъектОбработки.ФормироватьНачисленияТолькоПоПортфелямСДвижениямиПоНДФЛ =
		Снимок.ФормироватьНачисленияТолькоПоПортфелямСДвижениямиПоНДФЛ;
	ОбъектОбработки.ФормироватьПоЗакрытымПортфелямСПоступлениемНКД = Снимок.ФормироватьПоЗакрытымПортфелямСПоступлениемНКД;
	ОбъектОбработки.ДатыДокументов.Загрузить(Снимок.ДатыДокументов.Скопировать());
	
КонецПроцедуры

// Описание: Упаковывает итог оркестратора во временное хранилище по адресу АдресРезультата (контракт формы).
//
// Параметры:
// АдресРезультата - Строка - адрес ВХ, переданный БСП в процедуру ДО.
// Успешно - Булево - признак успешного завершения без фатальной ошибки.
// ТекстДиагностики - Строка - текст ошибки или пояснение.
// ТабличныйДокумент - ТабличныйДокумент - лог формирования (может быть пустым); кладётся в Итог как поле «ТабличныйДокумент» (одно чтение ВХ на клиенте).
// СнимокОбъектаПосле - Структура, Неопределено - снимок объекта после СоздатьДокументы для обновления формы.
// ИдентификаторФормы - УникальныйИдентификатор - владелец ВХ для вложенного снимка (адрес в Итог.АдресСнимкаОбъекта).
// ЧастичныйУспех - Булево - часть пачек завершилась с ошибкой (итерация 2–3).
// УпавшиеПачки - Массив - номера пачек с ошибками (строки/числа).
//
Процедура NDFL_RDU_ЗаписатьРезультатОркестратораВоВременноеХранилище(АдресРезультата, Успешно, ТекстДиагностики,
	ТабличныйДокумент, СнимокОбъектаПосле, ИдентификаторФормы, ЧастичныйУспех = Ложь, УпавшиеПачки = Неопределено)
	
	АдресСнимкаОбъекта = "";
	Если СнимокОбъектаПосле <> Неопределено Тогда
		АдресСнимкаОбъекта = ПоместитьВоВременноеХранилище(СнимокОбъектаПосле, ИдентификаторФормы);
	КонецЕсли;
	
	Итог = Новый Структура;
	Итог.Вставить("Успешно", Успешно);
	Итог.Вставить("ТекстДиагностики", ТекстДиагностики);
	Итог.Вставить("ТабличныйДокумент", ТабличныйДокумент);
	Итог.Вставить("АдресСнимкаОбъекта", АдресСнимкаОбъекта);
	Итог.Вставить("ЧастичныйУспех", ЧастичныйУспех);
	Если УпавшиеПачки = Неопределено Тогда
		Итог.Вставить("УпавшиеПачки", Новый Массив);
	Иначе
		Итог.Вставить("УпавшиеПачки", УпавшиеПачки);
	КонецЕсли;
	
	ПоместитьВоВременноеХранилище(Итог, АдресРезультата);
	
КонецПроцедуры

// Описание: Поверхностная копия снимка обработки (структура с копией таблицы ДатыДокументов).
//
// Параметры:
// ИсходныйСнимок - Структура - снимок по контракту NDFL_RDU_СнимокОбъектаОбработки.
//
// Возвращаемое значение:
// Структура - независимая копия для передачи в параметры пачки (поле Шапка).
//
Функция NDFL_RDU_КлонироватьСнимок(ИсходныйСнимок)
	
	Копия = Новый Структура;
	Копия.Вставить("ПериодДатаНачала", ИсходныйСнимок.ПериодДатаНачала);
	Копия.Вставить("ПериодДатаОкончания", ИсходныйСнимок.ПериодДатаОкончания);
	Копия.Вставить("НалоговыйПериод", ИсходныйСнимок.НалоговыйПериод);
	Копия.Вставить("НеСоздаватьДокументыПоКлиентамБезЦБ", ИсходныйСнимок.НеСоздаватьДокументыПоКлиентамБезЦБ);
	Копия.Вставить("НомерСтрокиПо", ИсходныйСнимок.НомерСтрокиПо);
	Копия.Вставить("НомерСтрокиС", ИсходныйСнимок.НомерСтрокиС);
	Копия.Вставить("ВариантЗаполнения", ИсходныйСнимок.ВариантЗаполнения);
	Копия.Вставить("Клиент", ИсходныйСнимок.Клиент);
	Копия.Вставить("НеСоздаватьДокументыБезУдержаний", ИсходныйСнимок.НеСоздаватьДокументыБезУдержаний);
	Копия.Вставить("СоздаватьОплатуНДФЛ", ИсходныйСнимок.СоздаватьОплатуНДФЛ);
	Копия.Вставить("СхемаВыплаты", ИсходныйСнимок.СхемаВыплаты);
	Копия.Вставить("СчетДляОплатыНалогов", ИсходныйСнимок.СчетДляОплатыНалогов);
	Копия.Вставить("УправляющаяКомпания", ИсходныйСнимок.УправляющаяКомпания);
	Копия.Вставить("ФормироватьНачисленияПоЗакрытымПортфелям", ИсходныйСнимок.ФормироватьНачисленияПоЗакрытымПортфелям);
	Копия.Вставить("ФормироватьНачисленияТолькоПоПортфелямСДвижениямиПоНДФЛ",
		ИсходныйСнимок.ФормироватьНачисленияТолькоПоПортфелямСДвижениямиПоНДФЛ);
	Копия.Вставить("ФормироватьПоЗакрытымПортфелямСПоступлениемНКД", ИсходныйСнимок.ФормироватьПоЗакрытымПортфелямСПоступлениемНКД);
	Копия.Вставить("ДатыДокументов", ИсходныйСнимок.ДатыДокументов.Скопировать());
	
	Возврат Копия;
	
КонецФункции

// Описание: Собирает упорядоченный массив номеров строк ТЧ «ДатыДокументов» с учётом отборов шапки (ТЗ п. 5.1, 6.1):
// НомерСтрокиС..НомерСтрокиПо (с Прервать по верхней границе как в типовом СоздатьДокументы), флаг «без ЦБ».
// Результат — множество допустимых глобальных номеров для пересечения с K окнами в NDFL_RDU_РазбитьСтрокиНаПачки(..., Снимок).
//
// Параметры:
// Снимок - Структура - снимок обработки (поле ДатыДокументов — ТаблицаЗначений).
//
// Возвращаемое значение:
// Массив из Число - номера строк в порядке обхода ТЧ.
//
Функция NDFL_RDU_СобратьИндексыСтрокПоСнимку(Снимок)
	
	Результат = Новый Массив;
	Если Не Снимок.Свойство("ДатыДокументов") Или Снимок.ДатыДокументов = Неопределено Тогда
		Возврат Результат;
	КонецЕсли;
	
	ТаблицаДат = Снимок.ДатыДокументов;
	Если ТаблицаДат.Количество() = 0 Тогда
		Возврат Результат;
	КонецЕсли;
	
	ОтборПоНомеруСтроки = Снимок.НомерСтрокиС <> 0 Или Снимок.НомерСтрокиПо <> 0;
	
	КлиентыСЦБ = Неопределено;
	Если Снимок.НеСоздаватьДокументыПоКлиентамБезЦБ Тогда
		// IMDEV-7330 Вызов через менеджер обработки: список клиентов с ЦБ — типовой метод объекта недоступен без экземпляра.
		ВремОбъект = Обработки.ФормированиеНачисленийНДФЛ.Создать();
		NDFL_RDU_ЗаполнитьОбъектОбработкиИзСнимка(ВремОбъект, Снимок);
		КлиентыСЦБ = ВремОбъект.СписокКлиентовСЦБ();
	КонецЕсли;
	
	Для Каждого СтрокаДокументов Из ТаблицаДат Цикл
		
		Если ОтборПоНомеруСтроки Тогда
			Если Снимок.НомерСтрокиС <> 0 И СтрокаДокументов.НомерСтроки < Снимок.НомерСтрокиС Тогда
				Продолжить;
			ИначеЕсли Снимок.НомерСтрокиПо <> 0 И СтрокаДокументов.НомерСтроки > Снимок.НомерСтрокиПо Тогда
				Прервать;
			КонецЕсли;
		КонецЕсли;
		
		Если Снимок.НеСоздаватьДокументыПоКлиентамБезЦБ И КлиентыСЦБ <> Неопределено
			И КлиентыСЦБ.Найти(СтрокаДокументов.Клиент) = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Результат.Добавить(СтрокаДокументов.НомерСтроки);
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Описание: Проверяет, запрошена ли отмена текущего фонового задания ДО (родитель оркестратора).
//
// Возвращаемое значение:
// Булево - Истина, если задание отменено или не активно.
//
Функция NDFL_RDU_ОтменаРодительскогоЗаданияДО()
	
	Задание = ПолучитьТекущийСеансИнформационнойБазы().ПолучитьФоновоеЗадание();
	Если Задание = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если Задание.Состояние = СостояниеФоновогоЗадания.Отменено Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункцииЗапускПачкиБСП

// Описание: Старт расчёта одной пачки через БСП ДлительныеОперации (паттерн ВыполнитьПроцедуруМодуляОбъектаОбработки,
//           как во внешнем отчёте внОтчетОФинансовомРезультате_ЕПС: отдельный УИД формы, ключ и наименование ФЗ,
//           ЗапуститьВФоне, проверка РезультатВыполнения.Статус после ВыполнитьВФоне).
//
// Параметры:
// ПараметрыПачки - Структура - результат NDFL_RDU_ПодготовитьПараметрыПачки.
// НомерПачки - Число - номер с 1 (для заголовка ФЗ).
// ВсегоПачек - Число - всего пачек (для заголовка ФЗ).
//
// Возвращаемое значение:
// ФоновоеЗадание, Неопределено - объект задания для ожидания/отмены; Неопределено, если по ИД найти задание не удалось.
//
Функция NDFL_RDU_ЗапуститьПачкуФормированияНДФЛЧерезБСП(ПараметрыПачки, НомерПачки, ВсегоПачек)
	
	ПараметрыВыполненияПроцедуры = Новый Структура;
	ПараметрыВыполненияПроцедуры.Вставить("ПараметрыXML", NDFL_RDU_ДанныеВXML(ПараметрыПачки));
	
	ПараметрыЗадания = Новый Структура;
	ПараметрыЗадания.Вставить("ИмяОбработки", "ФормированиеНачисленийНДФЛ");
	ПараметрыЗадания.Вставить("ИмяМетода", "NDFL_RDU_ВыполнитьПачкуФормированияНДФЛ");
	ПараметрыЗадания.Вставить("ПараметрыВыполнения", ПараметрыВыполненияПроцедуры);
	ПараметрыЗадания.Вставить("ЭтоВнешняяОбработка", Ложь);
	
	// IMDEV-7330 Как в шаблоне БСП для внешних отчётов: отдельный УИД владельца ВХ служебного результата ДО (не УИД формы оркестратора).
	УникальныйИдентификаторПараметровВыполнения = Новый УникальныйИдентификатор;
	ПараметрыВыполненияВФоне = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификаторПараметровВыполнения);
	ПараметрыВыполненияВФоне.КлючФоновогоЗадания = Строка(Новый УникальныйИдентификатор);
	ПараметрыВыполненияВФоне.НаименованиеФоновогоЗадания = СтрШаблон(
		НСтр("ru = 'IMDEV-7330: формирование НДФЛ, пачка %1 из %2'"), НомерПачки, ВсегоПачек);
	ПараметрыВыполненияВФоне.ЗапуститьВФоне = Истина;
	ПараметрыВыполненияВФоне.ОжидатьЗавершение = 0;
	
	РезультатВыполнения = ДлительныеОперации.ВыполнитьВФоне(
		"ДлительныеОперации.ВыполнитьПроцедуруМодуляОбъектаОбработки",
		ПараметрыЗадания,
		ПараметрыВыполненияВФоне);
	
	Если РезультатВыполнения.Статус = "Ошибка" Тогда
		ВызватьИсключение РезультатВыполнения.КраткоеПредставлениеОшибки;
	КонецЕсли;
	
	// IMDEV-7330 Как в ЕПС: из результата ДО снимаем ИД задания и адрес служебного результата БСП.
	ИдентификаторЗадания = РезультатВыполнения.ИдентификаторЗадания;
	АдресРезультатаБСП = РезультатВыполнения.АдресРезультата;
	// IMDEV-7330 АдресРезультатаБСП — ВХ для признака успеха воркера (второй параметр процедуры модуля объекта); сшивка и лог пачки
	// берутся из АдресРезультатаПачки в ПараметрыПачки, а не из АдресРезультатаБСП. Ожидание завершения — по ФоновомуЗаданию, не по опросу этого адреса.
	
	Задание = Неопределено;
	Если ЗначениеЗаполнено(ИдентификаторЗадания) Тогда
		Задание = ФоновыеЗадания.НайтиПоУникальномуИдентификатору(ИдентификаторЗадания);
	КонецЕсли;
	
	Возврат Задание;
	
КонецФункции

#КонецОбласти

// Описание: Тело основной длительной операции БСП: итерация 1 — один объект и один вызов СоздатьДокументы;
// итерация 2 — разбиение на пачки, параллельные ФЗ, прогресс и сшивка; итерация 3 — отмена дочерних ФЗ при отмене ДО.
//
// Параметры:
// Параметры - Структура - либо поля Снимок, ИдентификаторФормы (УникальныйИдентификатор), либо одно поле ПараметрыXML (строка
//   с сериализованной структурой тех же полей через NDFL_RDU_ДанныеВXML — как при запуске из формы).
// АдресРезультата - Строка - адрес во временном хранилище для помещения итоговой структуры результата.
//
Процедура NDFL_RDU_ОркестраторФормированияНДФЛ(Параметры, АдресРезультата) Экспорт
	
	СтрокаВхода = "";
	Если Параметры <> Неопределено И Параметры.Свойство("ПараметрыXML", СтрокаВхода) И ЗначениеЗаполнено(СтрокаВхода) Тогда
		Попытка
			Параметры = NDFL_RDU_ДанныеИзXML(СтрокаВхода);
		Исключение
			ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			ЗаписьЖурналаРегистрации(НСтр("ru = 'IMDEV-7330. Формирование НДФЛ (оркестратор): ошибка разбора XML параметров ДО'"),
				УровеньЖурналаРегистрации.Ошибка, , , ТекстОшибки);
			ВызватьИсключение НСтр("ru = 'NDFL_RDU: ошибка разбора XML параметров длительной операции.'") + Символы.ПС + ТекстОшибки;
		КонецПопытки;
	КонецЕсли;
	
	ИдентификаторФормы = Неопределено;
	Если Не Параметры.Свойство("ИдентификаторФормы", ИдентификаторФормы) Или Не ЗначениеЗаполнено(ИдентификаторФормы) Тогда
		ВызватьИсключение НСтр("ru = 'NDFL_RDU: не передан ИдентификаторФормы в параметрах длительной операции.'");
	КонецЕсли;
	
	Снимок = Неопределено;
	Если Не Параметры.Свойство("Снимок", Снимок) Или Снимок = Неопределено Тогда
		ВызватьИсключение НСтр("ru = 'NDFL_RDU: не передан снимок обработки в параметрах длительной операции.'");
	КонецЕсли;
	
	Попытка
		
		ИндексыСтрок = NDFL_RDU_СобратьИндексыСтрокПоСнимку(Снимок);
		Если ИндексыСтрок.Количество() = 0 Тогда
			ТабПустой = Новый ТабличныйДокумент;
			NDFL_RDU_ЗаписатьРезультатОркестратораВоВременноеХранилище(АдресРезультата, Истина, "", ТабПустой,
				Снимок, ИдентификаторФормы, Ложь, Новый Массив);
			Возврат;
		КонецЕсли;
		
		KИсх = Константы.NDFL_RDU_ЧислоПараллельныхПачекФормированияНДФЛ.Получить();
		K = Макс(1, Цел(KИсх));
		K = Мин(K, 50);
		
		ПачкиИндексов = NDFL_RDU_РазбитьСтрокиНаПачки(ИндексыСтрок, K, Снимок);
		
		Если ПачкиИндексов.Количество() <= 1 Тогда
			
			ОбъектОбработки = Обработки.ФормированиеНачисленийНДФЛ.Создать();
			NDFL_RDU_ЗаполнитьОбъектОбработкиИзСнимка(ОбъектОбработки, Снимок);
			ТабличныйДокумент = Новый ТабличныйДокумент;
			ОбъектОбработки.СоздатьДокументы(ТабличныйДокумент);
			СнимокПосле = NDFL_RDU_СнимокОбъектаОбработки(ОбъектОбработки);
			NDFL_RDU_ЗаписатьРезультатОркестратораВоВременноеХранилище(АдресРезультата, Истина, "", ТабличныйДокумент,
				СнимокПосле, ИдентификаторФормы, Ложь, Новый Массив);
			Возврат;
			
		КонецЕсли;
		
		АдресПрогресса = ПоместитьВоВременноеХранилище(NDFL_RDU_СтруктураПрогрессаОркестратора(ПачкиИндексов.Количество(),
			ИндексыСтрок.Количество()), ИдентификаторФормы);
		
		МассивЗаданий = Новый Массив;
		МассивПараметровПачек = Новый Массив;
		ВсегоПачек = ПачкиИндексов.Количество();
		НомерПачки = 0;
		Для Каждого ПачкаИндексов Из ПачкиИндексов Цикл
			НомерПачки = НомерПачки + 1;
			ПараметрыПачки = NDFL_RDU_ПодготовитьПараметрыПачки(Снимок, НомерПачки, ВсегоПачек, ПачкаИндексов,
				ИдентификаторФормы, АдресПрогресса);
			МассивПараметровПачек.Добавить(ПараметрыПачки);
			
			МассивЗаданий.Добавить(NDFL_RDU_ЗапуститьПачкуФормированияНДФЛЧерезБСП(ПараметрыПачки, НомерПачки, ВсегоПачек));
		КонецЦикла;
		
		Пока Истина Цикл
			
			Если NDFL_RDU_ОтменаРодительскогоЗаданияДО() Тогда
				NDFL_RDU_ОтменитьЗаданияПачек(МассивЗаданий);
				ТабОтмена = Новый ТабличныйДокумент;
				NDFL_RDU_ЗаписатьРезультатОркестратораВоВременноеХранилище(АдресРезультата, Ложь,
					НСтр("ru = 'Формирование НДФЛ прервано по запросу пользователя.'"), ТабОтмена, Снимок, ИдентификаторФормы,
					Истина, Новый Массив);
				Возврат;
			КонецЕсли;
			
			ВсеЗавершены = Истина;
			Для Каждого Задание Из МассивЗаданий Цикл
				Если Задание = Неопределено Тогда
					Продолжить;
				КонецЕсли;
				Если Задание.Состояние = СостояниеФоновогоЗадания.Активно Тогда
					ВсеЗавершены = Ложь;
					Попытка
						Задание.ОжидатьЗавершенияВыполнения(0.2);
					Исключение
						// IMDEV-7330 Игнорируем таймаут/гонку: следующая итерация цикла перепроверит состояние.
					КонецПопытки;
				КонецЕсли;
			КонецЦикла;
			
			NDFL_RDU_ОбновитьПрогрессОркестратораПоЗаданиям(АдресПрогресса, МассивЗаданий, ПачкиИндексов, ИдентификаторФормы);
			
			Если ВсеЗавершены Тогда
				Прервать;
			КонецЕсли;
			
		КонецЦикла;
		
		РезультатыПачек = Новый Массив;
		УпавшиеПачки = Новый Массив;
		Индекс = 0;
		Для Каждого ПараметрыПачки Из МассивПараметровПачек Цикл
			Индекс = Индекс + 1;
			АдресРезультатаПачки = "";
			ПараметрыПачки.Свойство("АдресРезультатаПачки", АдресРезультатаПачки);
			РезПачки = ПолучитьИзВременногоХранилища(АдресРезультатаПачки);
			Если РезПачки = Неопределено Или ТипЗнч(РезПачки) <> Тип("Структура") Тогда
				УпавшиеПачки.Добавить(Индекс);
				Продолжить;
			КонецЕсли;
			РезультатыПачек.Добавить(РезПачки);
			ФлагОшибки = Ложь;
			Если РезПачки.Свойство("ЕстьОшибка", ФлагОшибки) И ФлагОшибки Тогда
				УпавшиеПачки.Добавить(Индекс);
			КонецЕсли;
		КонецЦикла;
		
		ИтогСшивки = NDFL_RDU_СшитьРезультатыПачекФормированияНДФЛ(РезультатыПачек);
		Частичный = УпавшиеПачки.Количество() > 0;
		ТекстДиагностики = "";
		Если Частичный Тогда
			ТекстДиагностики = НСтр("ru = 'Часть пачек завершилась с ошибкой. См. лог и список номеров пачек.'");
		КонецЕсли;
		УспехИтог = Не Частичный;
		// IMDEV-7330 После параллельных воркеров единый объект обработки не восстанавливаем: в форму не передаём снимок ТЧ (избегаем затирания актуальными данными одним исходным снимком).
		NDFL_RDU_ЗаписатьРезультатОркестратораВоВременноеХранилище(АдресРезультата, УспехИтог, ТекстДиагностики,
			ИтогСшивки.ТабличныйДокумент, Неопределено, ИдентификаторФормы, Частичный, УпавшиеПачки);
		
	Исключение
		
		ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЗаписьЖурналаРегистрации(НСтр("ru = 'IMDEV-7330. Формирование НДФЛ (оркестратор)'"),
			УровеньЖурналаРегистрации.Ошибка, , , ТекстОшибки);
		ТабОшибка = Новый ТабличныйДокумент;
		NDFL_RDU_ЗаписатьРезультатОркестратораВоВременноеХранилище(АдресРезультата, Ложь, ТекстОшибки, ТабОшибка,
			Неопределено, ИдентификаторФормы, Ложь, Новый Массив);
		
	КонецПопытки;
	
КонецПроцедуры

Процедура NDFL_RDU_ОтменитьЗаданияПачек(МассивЗаданий)
	
	Для Каждого Задание Из МассивЗаданий Цикл
		Если Задание = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		Если Задание.Состояние = СостояниеФоновогоЗадания.Активно Тогда
			Попытка
				Задание.Отменить();
			Исключение
				ЗаписьЖурналаРегистрации(НСтр("ru = 'IMDEV-7330. Отмена фонового задания пачки НДФЛ'"),
					УровеньЖурналаРегистрации.Предупреждение, , , ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			КонецПопытки;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Функция NDFL_RDU_СтруктураПрогрессаОркестратора(ВсегоПачек, ВсегоСтрок)
	
	Прогресс = Новый Структура;
	Прогресс.Вставить("ВсегоПачек", ВсегоПачек);
	Прогресс.Вставить("ВсегоСтрок", ВсегоСтрок);
	Прогресс.Вставить("ЗавершеноПачек", 0);
	Прогресс.Вставить("ОбработаноСтрок", 0);
	Прогресс.Вставить("ТекстЭтапа", "");
	Возврат Прогресс;
	
КонецФункции

Процедура NDFL_RDU_ОбновитьПрогрессОркестратораПоЗаданиям(АдресПрогресса, МассивЗаданий, ПачкиИндексов, ИдентификаторФормы)
	
	Прогресс = ПолучитьИзВременногоХранилища(АдресПрогресса);
	Если Прогресс = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЗавершеноПачек = 0;
	ОбработаноСтрок = 0;
	Номер = 0;
	Для Каждого Задание Из МассивЗаданий Цикл
		Номер = Номер + 1;
		Если Задание = Неопределено Тогда
			ЗавершеноПачек = ЗавершеноПачек + 1;
			Если Номер <= ПачкиИндексов.Количество() Тогда
				ОбработаноСтрок = ОбработаноСтрок + ПачкиИндексов[Номер - 1].Количество();
			КонецЕсли;
			Продолжить;
		КонецЕсли;
		Если Задание.Состояние <> СостояниеФоновогоЗадания.Активно Тогда
			ЗавершеноПачек = ЗавершеноПачек + 1;
			Если Номер <= ПачкиИндексов.Количество() Тогда
				ОбработаноСтрок = ОбработаноСтрок + ПачкиИндексов[Номер - 1].Количество();
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Прогресс.ЗавершеноПачек = ЗавершеноПачек;
	Прогресс.ОбработаноСтрок = ОбработаноСтрок;
	Процент = 0;
	Если Прогресс.ВсегоСтрок > 0 Тогда
		Процент = Окр(100 * ОбработаноСтрок / Прогресс.ВсегоСтрок, 0);
	КонецЕсли;
	ТекстПачек = СтрШаблон(НСтр("ru = 'Пачки: завершено %1 из %2; строк: %3 из %4'"),
		ЗавершеноПачек, Прогресс.ВсегоПачек, ОбработаноСтрок, Прогресс.ВсегоСтрок);
	Прогресс.ТекстЭтапа = ТекстПачек;
	ПоместитьВоВременноеХранилище(Прогресс, АдресПрогресса);
	ДлительныеОперации.СообщитьПрогресс(Процент, ТекстПачек);
	
КонецПроцедуры

// Описание: Сериализация структуры параметров в XML-строку для передачи во фоновые задания и в длительную операцию (поле ПараметрыXML).
// Паттерн как в общем модуле ExchDU_ОбработкаОбъектовПослеЗагрузки (cfe VTB_ExchangeDU): ЗаписьXML + СериализаторXDTO.ЗаписатьXML.
//
// Параметры:
// Данные - Произвольный - структура с таблицами значений и примитивами, допустимая для XDTO.
//
// Возвращаемое значение:
// Строка - XML-текст.
//
Функция NDFL_RDU_ДанныеВXML(Знач Данные) Экспорт
	
	ЗаписьXML = Новый ЗаписьXML();
	ЗаписьXML.УстановитьСтроку();
	СериализаторXDTO.ЗаписатьXML(ЗаписьXML, Данные);
	Возврат ЗаписьXML.Закрыть();
	
КонецФункции

// Описание: Десериализация XML-строки параметров после передачи во фоновое задание или в оркестратор ДО.
//
// Параметры:
// СтрокаXML - Строка - результат NDFL_RDU_ДанныеВXML.
//
// Возвращаемое значение:
// Произвольный - восстановленное значение (обычно Структура).
//
Функция NDFL_RDU_ДанныеИзXML(Знач СтрокаXML) Экспорт
	
	ЧтениеXML = Новый ЧтениеXML();
	ЧтениеXML.УстановитьСтроку(СтрокаXML);
	Возврат СериализаторXDTO.ПрочитатьXML(ЧтениеXML);
	
КонецФункции

// Описание: Пустая таблица сообщений для структуры результата одной пачки (колонки Порядок, Текст).
//
// Возвращаемое значение:
// ТаблицаЗначений - шаблон списка сообщений пачки.
//
Функция NDFL_RDU_ТаблицаСообщенийПачки() Экспорт
	
	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("Порядок", Новый ОписаниеТипов("Число"));
	ТЗ.Колонки.Добавить("Текст", Новый ОписаниеТипов("Строка"));
	Возврат ТЗ;
	
КонецФункции

// Описание: Формирует не более K непустых непересекающихся пачек номеров строк ТЧ «ДатыДокументов» (ТЗ п. 5, 5.1).
// Множество отобранных номеров задаётся ИндексыСтрок (НомерСтрокиС..НомерСтрокиПо, ЦБ — через NDFL_RDU_СобратьИндексыСтрокПоСнимку).
// Геометрия: K окон на полной ТЧ по глобальным НомерСтроки, W = Ceil(МаксНомер/K); пачка j — пересечение окна с отбором.
// Пустое пересечение не порождает воркер. При СнимокПолнойТЧ сливаются соседние пачки с общим Клиентом на границе окон.
//
// Параметры:
// ИндексыСтрок - Массив из Число - номера строк, прошедшие отборы (порядок обхода как в типовом цикле).
// КоличествоПачекПользователя - Число - K из константы.
// СнимокПолнойТЧ - Структура, Неопределено - снимок с ДатыДокументов; при Неопределено — деление только по ИндексыСтрок (совместимость).
//
// Возвращаемое значение:
// Массив - массивы номеров строк по пачкам; пустые пачки не включаются; при N < 2 — одна пачка (временно для отладки параллелизма при малых N).
//
Функция NDFL_RDU_РазбитьСтрокиНаПачки(ИндексыСтрок, КоличествоПачекПользователя, СнимокПолнойТЧ = Неопределено) Экспорт
	
	K = Макс(1, Цел(КоличествоПачекПользователя));
	
	Результат = Новый Массив;
	Если ИндексыСтрок.Количество() = 0 Тогда
		Возврат Результат;
	КонецЕсли;
	
	Если ИндексыСтрок.Количество() < 2 Тогда
		Копия = Новый Массив;
		Для Каждого Инд Из ИндексыСтрок Цикл
			Копия.Добавить(Инд);
		КонецЦикла;
		Результат.Добавить(Копия);
		Возврат Результат;
	КонецЕсли;
	
	Если СнимокПолнойТЧ = Неопределено
		Или Не СнимокПолнойТЧ.Свойство("ДатыДокументов")
		Или СнимокПолнойТЧ.ДатыДокументов = Неопределено Тогда
		
		ЧислоСтрок = ИндексыСтрок.Количество();
		БазовыйРазмер = Цел(ЧислоСтрок / K);
		Остаток = ЧислоСтрок - БазовыйРазмер * K;
		ТекущийИндекс = 0;
		Для НомерОкна = 1 По K Цикл
			РазмерПачки = БазовыйРазмер + ?(НомерОкна <= Остаток, 1, 0);
			Если РазмерПачки <= 0 Тогда
				Продолжить;
			КонецЕсли;
			Пачка = Новый Массив;
			Для Сч = 1 По РазмерПачки Цикл
				Если ТекущийИндекс >= ИндексыСтрок.Количество() Тогда
					Прервать;
				КонецЕсли;
				Пачка.Добавить(ИндексыСтрок[ТекущийИндекс]);
				ТекущийИндекс = ТекущийИндекс + 1;
			КонецЦикла;
			Если Пачка.Количество() > 0 Тогда
				Результат.Добавить(Пачка);
			КонецЕсли;
		КонецЦикла;
		Возврат Результат;
		
	КонецЕсли;
	
	ТаблицаДат = СнимокПолнойТЧ.ДатыДокументов;
	МаксНомер = NDFL_RDU_МаксНомерСтрокиТЧДатыДокументов(ТаблицаДат);
	Если МаксНомер <= 0 Тогда
		Копия = Новый Массив;
		Для Каждого Инд Из ИндексыСтрок Цикл
			Копия.Добавить(Инд);
		КонецЦикла;
		Результат.Добавить(Копия);
		Возврат Результат;
	КонецЕсли;
	
	ДопустимыеНомера = NDFL_RDU_МножествоНомеровСтрокИзМассива(ИндексыСтрок);
	РазмерОкна = Цел((МаксНомер + K - 1) / K);
	Если РазмерОкна <= 0 Тогда
		РазмерОкна = 1;
	КонецЕсли;
	
	ПачкиПоОкнам = Новый Массив;
	Для НомОкна = 1 По K Цикл
		ГлобС = (НомОкна - 1) * РазмерОкна + 1;
		ГлобПо = Мин(НомОкна * РазмерОкна, МаксНомер);
		Если ГлобС > ГлобПо Тогда
			Продолжить;
		КонецЕсли;
		Пачка = Новый Массив;
		Для Каждого Стр Из ТаблицаДат Цикл
			НС = Стр.НомерСтроки;
			Если НС < ГлобС Или НС > ГлобПо Тогда
				Продолжить;
			КонецЕсли;
			Если ДопустимыеНомера.Получить(НС) = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			Пачка.Добавить(НС);
		КонецЦикла;
		Если Пачка.Количество() > 0 Тогда
			ПачкиПоОкнам.Добавить(Пачка);
		КонецЕсли;
	КонецЦикла;
	
	NDFL_RDU_СлитьСоседниеПачкиПоОбщемуКлиенту(ПачкиПоОкнам, ТаблицаДат);
	
	Если ПачкиПоОкнам.Количество() = 0 Тогда
		Копия = Новый Массив;
		Для Каждого Инд Из ИндексыСтрок Цикл
			Копия.Добавить(Инд);
		КонецЦикла;
		Результат.Добавить(Копия);
		Возврат Результат;
	КонецЕсли;
	
	Возврат ПачкиПоОкнам;
	
КонецФункции

// Описание: Максимальный НомерСтроки в полной выгрузке ТЧ «ДатыДокументов» (верхняя граница геометрии K окон).
//
// Параметры:
// ТаблицаДат - ТаблицаЗначений - выгрузка ТЧ со стандартным реквизитом НомерСтроки.
//
// Возвращаемое значение:
// Число - максимальный номер или 0 при пустой таблице.
//
Функция NDFL_RDU_МаксНомерСтрокиТЧДатыДокументов(ТаблицаДат)
	
	Макс = 0;
	Для Каждого Стр Из ТаблицаДат Цикл
		Если Стр.НомерСтроки > Макс Тогда
			Макс = Стр.НомерСтроки;
		КонецЕсли;
	КонецЦикла;
	Возврат Макс;
	
КонецФункции

// Описание: Соответствие «номер строки ТЧ -> Истина» для проверки вхождения строки в отобранное множество.
//
Функция NDFL_RDU_МножествоНомеровСтрокИзМассива(ИндексыСтрок)
	
	Соотв = Новый Соответствие;
	Для Каждого Ном Из ИндексыСтрок Цикл
		Соотв.Вставить(Ном, Истина);
	КонецЦикла;
	Возврат Соотв;
	
КонецФункции

// Описание: Множество клиентов по номерам строк ТЧ (для слияния соседних пачек с общим клиентом).
//
Функция NDFL_RDU_МножествоКлиентовПоНомерамСтрок(ТаблицаДат, МассивНомеров)
	
	КешНомерКлиент = Новый Соответствие;
	Для Каждого Стр Из ТаблицаДат Цикл
		КешНомерКлиент.Вставить(Стр.НомерСтроки, Стр.Клиент);
	КонецЦикла;
	
	Клиенты = Новый Соответствие;
	Для Каждого Ном Из МассивНомеров Цикл
		Кли = КешНомерКлиент.Получить(Ном);
		Если Кли <> Неопределено Тогда
			Клиенты.Вставить(Кли, Истина);
		КонецЕсли;
	КонецЦикла;
	Возврат Клиенты;
	
КонецФункции

// Описание: Проверяет пересечение множеств клиентов двух пачек номеров строк.
//
Функция NDFL_RDU_ЕстьОбщийКлиентМеждуПачками(ПачкаЛевая, ПачкаПравая, ТаблицаДат)
	
	Левые = NDFL_RDU_МножествоКлиентовПоНомерамСтрок(ТаблицаДат, ПачкаЛевая);
	КешНомерКлиент = Новый Соответствие;
	Для Каждого Стр Из ТаблицаДат Цикл
		КешНомерКлиент.Вставить(Стр.НомерСтроки, Стр.Клиент);
	КонецЦикла;
	Для Каждого Ном Из ПачкаПравая Цикл
		Кли = КешНомерКлиент.Получить(Ном);
		Если Кли <> Неопределено И Левые.Получить(Кли) <> Неопределено Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;
	Возврат Ложь;
	
КонецФункции

// Описание: Сливает соседние пачки, если один клиент встречается в обеих (не разносить по пачкам по возможности).
//
// Параметры:
// ПачкиПоОкнам - Массив - элементы: массивы номеров строк; изменяется на месте.
// ТаблицаДат - ТаблицаЗначений - полная ТЧ из снимка.
//
Процедура NDFL_RDU_СлитьСоседниеПачкиПоОбщемуКлиенту(ПачкиПоОкнам, ТаблицаДат)
	
	Если ПачкиПоОкнам.Количество() < 2 Тогда
		Возврат;
	КонецЕсли;
	
	Изменилось = Истина;
	Пока Изменилось Цикл
		Изменилось = Ложь;
		Инд = 0;
		Пока Инд < ПачкиПоОкнам.Количество() - 1 Цикл
			Если NDFL_RDU_ЕстьОбщийКлиентМеждуПачками(ПачкиПоОкнам[Инд], ПачкиПоОкнам[Инд + 1], ТаблицаДат) Тогда
				Для Каждого Ном Из ПачкиПоОкнам[Инд + 1] Цикл
					ПачкиПоОкнам[Инд].Добавить(Ном);
				КонецЦикла;
				ПачкиПоОкнам.Удалить(Инд + 1);
				Изменилось = Истина;
			Иначе
				Инд = Инд + 1;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

// Описание: Заполняет объект обработки воркера из параметров одной пачки: шапка, подмножество строк ТЧ, обнуление НомерСтрокиС/По.
//
// Параметры:
// ОбъектОбработки - ОбработкаОбъект.ФормированиеНачисленийНДФЛ - целевой экземпляр воркера.
// ПараметрыПачки - Структура - данные пачки (ТЗ п. 5.1, п. 6).
//
Процедура NDFL_RDU_ЗаполнитьОбработкуИзПараметровПачки(ОбъектОбработки, ПараметрыПачки) Экспорт
	
	Шапка = Неопределено;
	Если Не ПараметрыПачки.Свойство("Шапка", Шапка) Или Шапка = Неопределено Тогда
		ВызватьИсключение НСтр("ru = 'NDFL_RDU: в параметрах пачки нет шапки (Шапка).'");
	КонецЕсли;
	
	NDFL_RDU_ЗаполнитьОбъектОбработкиИзСнимка(ОбъектОбработки, Шапка);
	
	СтрокиДатыДокументов = Неопределено;
	Если Не ПараметрыПачки.Свойство("СтрокиДатыДокументов", СтрокиДатыДокументов)
		Или СтрокиДатыДокументов = Неопределено Тогда
		ВызватьИсключение НСтр("ru = 'NDFL_RDU: в параметрах пачки нет таблицы СтрокиДатыДокументов.'");
	КонецЕсли;
	
	ОбъектОбработки.ДатыДокументов.Очистить();
	Номер = 0;
	Для Каждого Стр Из СтрокиДатыДокументов Цикл
		Номер = Номер + 1;
		НоваяСтрока = ОбъектОбработки.ДатыДокументов.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Стр);
		НоваяСтрока.НомерСтроки = Номер;
	КонецЦикла;
	
	ОбъектОбработки.НомерСтрокиС = 0;
	ОбъектОбработки.НомерСтрокиПо = 0;
	
КонецПроцедуры

// Описание: Объединение табличных документов и таблиц сообщений воркеров в единый результат для формы.
//
// Параметры:
// РезультатыПачек - Массив - структуры результатов по номерам пачек (ТЗ п. 6).
//
// Возвращаемое значение:
// Структура - поля: ТабличныйДокумент (итоговый лог).
//
Функция NDFL_RDU_СшитьРезультатыПачекФормированияНДФЛ(РезультатыПачек) Экспорт
	
	ИтогТаб = Новый ТабличныйДокумент;
	
	Для Каждого Рез Из РезультатыПачек Цикл
		Если Рез = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		ТД = Неопределено;
		Если Рез.Свойство("ТабличныйДокумент", ТД) И ТД <> Неопределено Тогда
			ИтогТаб.Вывести(ТД);
		КонецЕсли;
	КонецЦикла;
	
	Возврат Новый Структура("ТабличныйДокумент", ИтогТаб);
	
КонецФункции

// Описание: Служебная подготовка структуры параметров одной пачки для передачи во воркер.
//
// Параметры:
// ИсходныйСнимок - Структура - полный снимок обработки с формы.
// НомерПачки - Число - индекс пачки с 1.
// ВсегоПачек - Число - число пачек.
// СтрокиПачки - Массив - номера строк исходной ТЧ, входящие в пачку.
// ИдентификаторФормы - УникальныйИдентификатор - владелец ВХ.
// АдресПрогресса - Строка - адрес общей структуры прогресса (опционально).
//
// Возвращаемое значение:
// Структура - параметры для воркера NDFL_RDU_ВыполнитьПачкуФормированияНДФЛ (модуль объекта обработки, сериализация в XML).
//
Функция NDFL_RDU_ПодготовитьПараметрыПачки(ИсходныйСнимок, НомерПачки, ВсегоПачек, СтрокиПачки, ИдентификаторФормы,
	АдресПрогресса = "") Экспорт
	
	ТаблицаИсходная = ИсходныйСнимок.ДатыДокументов;
	ОтборНомеров = Новый Соответствие;
	Для Каждого Ном Из СтрокиПачки Цикл
		ОтборНомеров.Вставить(Ном, Истина);
	КонецЦикла;
	
	СтрокиДатыДокументов = ТаблицаИсходная.СкопироватьКолонки();
	Для Каждого Стр Из ТаблицаИсходная Цикл
		Если ОтборНомеров.Получить(Стр.НомерСтроки) = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		Новая = СтрокиДатыДокументов.Добавить();
		ЗаполнитьЗначенияСвойств(Новая, Стр);
	КонецЦикла;
	
	ПараметрыЗапуска = Новый Структура;
	ПараметрыЗапуска.Вставить("АдресПрогресса", АдресПрогресса);
	ПараметрыЗапуска.Вставить("ИдентификаторФормы", ИдентификаторФормы);
	
	Шапка = NDFL_RDU_КлонироватьСнимок(ИсходныйСнимок);
	
	Результат = Новый Структура;
	Результат.Вставить("НомерПачки", НомерПачки);
	Результат.Вставить("ВсегоПачек", ВсегоПачек);
	Результат.Вставить("Шапка", Шапка);
	Результат.Вставить("СтрокиДатыДокументов", СтрокиДатыДокументов);
	Результат.Вставить("ПараметрыЗапуска", ПараметрыЗапуска);
	Результат.Вставить("ИдентификаторФормы", ИдентификаторФормы);
	Результат.Вставить("АдресРезультатаПачки", ПоместитьВоВременноеХранилище(Неопределено, ИдентификаторФормы));
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецЕсли
